In [1]:
import numpy as np
import pandas as pd

In [2]:
# List of Tuples
salaries = [(11, 5, 70000, 1000), (12, 7, 72200, 1100), (13, 11, 84999, 1000)]

# Create a DataFrame object
df = pd.DataFrame(salaries, columns=['ID', 'Experience' , 'Salary', 'Bonus'])
df

   ID  Experience  Salary  Bonus
0  11           5   70000   1000
1  12           7   72200   1100
2  13          11   84999   1000

In [3]:
# iterate over the dataframe row by row
for index_label, row_series in df.iterrows():
    # For each row update the 'Bonus' value to it's double
    df.at[index_label , 'Bonus'] = row_series['Bonus'] * 2
df

   ID  Experience  Salary  Bonus
0  11           5   70000   2000
1  12           7   72200   2200
2  13          11   84999   2000